trade_exp/src/Documents/СчетФактураВыданный/СчетФактураВыданный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СчетФактураВыданный</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="82e55215-7a69-44c4-9d89-19f24b9ecf72">
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f0b6a124-2f4c-418b-bd88-d90a523fc274">
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ac42ab45-3880-4751-b2ba-16d4a1a37293">
      <name>ХозяйственнаяОперация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5abf9a9e-6610-4520-bae5-a857db5a3bf3">
      <name>СчетФактураПолученныйОтПродавца</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a826145a-b460-4910-a747-db402c59fb03">
      <name>ПорядковыеНомераСтрок</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="a96d4ac2-d10a-4fee-87a1-589480786aff">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/РеестрДокументов/РеестрДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="44851db7-ace4-11e7-7088-f45c898df8f7">
  <name>РеестрДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="448617a8-ace4-11e7-7088-f45c898df8f7">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44862216-ace4-11e7-7088-f45c898df8f7">
    <name>ПометкаУдаления</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44862720-ace4-11e7-7088-f45c898df8f7">
    <name>ДатаПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="4485debe-ace4-11e7-7088-f45c898df8f7">
    <name>НомерДокументаИБ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44862c2a-ace4-11e7-7088-f45c898df8f7">
    <name>НомерПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44860178-ace4-11e7-7088-f45c898df8f7">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44861d0c-ace4-11e7-7088-f45c898df8f7">
    <name>Проведен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44863b70-ace4-11e7-7088-f45c898df8f7">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44863652-ace4-11e7-7088-f45c898df8f7">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="448607f4-ace4-11e7-7088-f45c898df8f7">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44863134-ace4-11e7-7088-f45c898df8f7">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44861276-ace4-11e7-7088-f45c898df8f7">
    <name>Дополнительно</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44860d4e-ace4-11e7-7088-f45c898df8f7">
    <name>ДополнительнаяЗапись</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="c033ddc4-ace7-11e7-7088-f45c898df8f7">
    <name>ДатаОтраженияВУчете</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="831ffe7e-f3df-4095-a10b-b5fb3a077003">
    <name>СторнируемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="9db0faa0-6639-4188-b1ae-45947ea159fa">
    <name>СторноИсправление</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="f67589b3-bd43-48f7-a0f9-db01f3da814e">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="448640c0-ace4-11e7-7088-f45c898df8f7">
    <name>ТипСсылки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="44864796-ace4-11e7-7088-f45c898df8f7">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="44867356-ace4-11e7-7088-f45c898df8f7">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="44866bd6-ace4-11e7-7088-f45c898df8f7">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="448698e0-ace4-11e7-7088-f45c898df8f7">
    <name>Ссылка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="448679be-ace4-11e7-7088-f45c898df8f7">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="448692aa-ace4-11e7-7088-f45c898df8f7">
    <name>ДатаДокументаИБ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="44868666-ace4-11e7-7088-f45c898df8f7">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="44868c92-ace4-11e7-7088-f45c898df8f7">
    <name>МестоХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>МногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Товар</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Работа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Набор</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/СчетФактураВыданный/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда


&Перед("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не (АльтерраОбщегоНазначения._РольДоступна("Бухгалтер") ИЛИ
		АльтерраОбщегоНазначения._РольДоступна("ПолныеПрава")) Тогда	
		если  ДокументыОснования.Количество()>0 тогда
		РазницаВДнях = (НачалоДня(Дата) - НачалоДня(ДокументыОснования[0].ДокументОснование.Дата)) / (60 * 60 * 24);
		Если РазницаВДнях>5 Тогда
			Сообщить("Разница между датой документа и датой основания не может быть больше 5 дней!");
			Отказ = Истина;
		КонецЕсли;                                   
		конецесли;
		
	КонецЕсли;

КонецПроцедуры


&НаСервере
Функция ПерезаполнитьТаблицуТоваров(ТаблицаТовары, Реализация)
	
	Запрос = Новый Запрос; 
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КорректировкаРеализации.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДанныеПоследнейКорректировки
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументовСторноИсправление
	|		ПО (КорректировкаРеализации.Ссылка = РеестрДокументовСторноИсправление.СторнируемыйДокумент)
	|			И (РеестрДокументовСторноИсправление.Проведен)
	|			И (НЕ РеестрДокументовСторноИсправление.ДополнительнаяЗапись)
	|ГДЕ
	|	КорректировкаРеализации.Проведен
	|	И КорректировкаРеализации.ВидКорректировки <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияПерепоставленногоТовара)
	|	И КорректировкаРеализации.ВидКорректировки <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратНедопоставленногоТовара)
	|	И КорректировкаРеализации.ДокументОснование = &Реализация
	|	И РеестрДокументовСторноИсправление.Ссылка ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	КорректировкаРеализации.МоментВремени УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	СУММА(ТаблицаТовары.Сумма) КАК Сумма,
	|	ТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ТаблицаТовары.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ ИсходныеДанные
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеПоследнейКорректировки КАК ДанныеПоследнейКорректировки
	|		ПО (ТаблицаТовары.Ссылка = ДанныеПоследнейКорректировки.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	ТаблицаТовары.СтавкаНДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	СУММА(ТаблицаТовары.Сумма + ТаблицаТовары.СуммаРТ),
	|	ТаблицаТовары.СтавкаНДС,
	|	СУММА(ТаблицаТовары.СуммаНДС + ТаблицаТовары.СуммаНДСРТ)
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоследнейКорректировки КАК ДанныеПоследнейКорректировки
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ДанныеПоследнейКорректировки.Ссылка ЕСТЬ NULL
	|	И ТаблицаТовары.Ссылка = &Реализация
	|	И ВЫБОР
	|			КОГДА ТаблицаТовары.Ссылка.РаспределитьТранспортные
	|				ТОГДА ТаблицаТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	ТаблицаТовары.СтавкаНДС
	|;
	|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураВыданныйТовары.НомерСтроки КАК НомерСтроки,
	|	СчетФактураВыданныйТовары.ПредыдущийСчетФактура КАК ПредыдущийСчетФактура,
	|	СчетФактураВыданныйТовары.ИсходныйСчетФактура КАК ИсходныйСчетФактура,
	|	СчетФактураВыданныйТовары.Номенклатура КАК Номенклатура,
	|	СчетФактураВыданныйТовары.Характеристика КАК Характеристика,
	|	СчетФактураВыданныйТовары.НоменклатураНабора КАК НоменклатураНабора,
	|	СчетФактураВыданныйТовары.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	СчетФактураВыданныйТовары.Содержание КАК Содержание,
	|	СчетФактураВыданныйТовары.ТипЗапасов КАК ТипЗапасов,
	|	СчетФактураВыданныйТовары.КодТНВЭД КАК КодТНВЭД,
	|	СчетФактураВыданныйТовары.НомерГТД КАК НомерГТД,
	|	СчетФактураВыданныйТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СчетФактураВыданныйТовары.Количество КАК Количество,
	|	СчетФактураВыданныйТовары.КоличествоУвеличение КАК КоличествоУвеличение,
	|	СчетФактураВыданныйТовары.КоличествоУменьшение КАК КоличествоУменьшение,
	|	СчетФактураВыданныйТовары.СуммаУвеличение КАК СуммаУвеличение,
	|	СчетФактураВыданныйТовары.СуммаУменьшение КАК СуммаУменьшение,
	|	СчетФактураВыданныйТовары.СуммаНДСУвеличение КАК СуммаНДСУвеличение,
	|	СчетФактураВыданныйТовары.СуммаНДСУменьшение КАК СуммаНДСУменьшение,
	|	СчетФактураВыданныйТовары.СчетФактураПолученныйОтПродавца КАК СчетФактураПолученныйОтПродавца,
	|	СчетФактураВыданныйТовары.НомерСтрокиПриПечати КАК НомерСтрокиПриПечати,
	|	СчетФактураВыданныйТовары.НомерСтрокиИсходногоСФ КАК НомерСтрокиИсходногоСФ,
	|	СчетФактураВыданныйТовары.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
	|	СчетФактураВыданныйТовары.КоличествоПоРНПТУвеличение КАК КоличествоПоРНПТУвеличение,
	|	СчетФактураВыданныйТовары.КоличествоПоРНПТУменьшение КАК КоличествоПоРНПТУменьшение,
	|	СчетФактураВыданныйТовары.Серия КАК Серия,
	|	СчетФактураВыданныйТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	СчетФактураВыданныйТовары.НоменклатураПартнера КАК НоменклатураПартнера
	|ПОМЕСТИТЬ СчетФактураВыданныйТовары
	|ИЗ
	|	&Товары КАК СчетФактураВыданныйТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураВыданныйТовары.НомерСтроки КАК НомерСтроки,
	|	СчетФактураВыданныйТовары.ПредыдущийСчетФактура КАК ПредыдущийСчетФактура,
	|	СчетФактураВыданныйТовары.ИсходныйСчетФактура КАК ИсходныйСчетФактура,
	|	СчетФактураВыданныйТовары.Номенклатура КАК Номенклатура,
	|	СчетФактураВыданныйТовары.Характеристика КАК Характеристика,
	|	СчетФактураВыданныйТовары.НоменклатураНабора КАК НоменклатураНабора,
	|	СчетФактураВыданныйТовары.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	СчетФактураВыданныйТовары.Содержание КАК Содержание,
	|	СчетФактураВыданныйТовары.ТипЗапасов КАК ТипЗапасов,
	|	СчетФактураВыданныйТовары.КодТНВЭД КАК КодТНВЭД,
	|	СчетФактураВыданныйТовары.НомерГТД КАК НомерГТД,
	|	СчетФактураВыданныйТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СчетФактураВыданныйТовары.Количество КАК Количество,
	|	СчетФактураВыданныйТовары.КоличествоУвеличение КАК КоличествоУвеличение,
	|	СчетФактураВыданныйТовары.КоличествоУменьшение КАК КоличествоУменьшение,
	|	СчетФактураВыданныйТовары.СуммаУвеличение КАК СуммаУвеличение,
	|	СчетФактураВыданныйТовары.СуммаУменьшение КАК СуммаУменьшение,
	|	СчетФактураВыданныйТовары.СуммаНДСУвеличение КАК СуммаНДСУвеличение,
	|	СчетФактураВыданныйТовары.СуммаНДСУменьшение КАК СуммаНДСУменьшение,
	|	СчетФактураВыданныйТовары.СчетФактураПолученныйОтПродавца КАК СчетФактураПолученныйОтПродавца,
	|	СчетФактураВыданныйТовары.НомерСтрокиПриПечати КАК НомерСтрокиПриПечати,
	|	СчетФактураВыданныйТовары.НомерСтрокиИсходногоСФ КАК НомерСтрокиИсходногоСФ,
	|	СчетФактураВыданныйТовары.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
	|	СчетФактураВыданныйТовары.КоличествоПоРНПТУвеличение КАК КоличествоПоРНПТУвеличение,
	|	СчетФактураВыданныйТовары.КоличествоПоРНПТУменьшение КАК КоличествоПоРНПТУменьшение,
	|	СчетФактураВыданныйТовары.Серия КАК Серия,
	|	СчетФактураВыданныйТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	СчетФактураВыданныйТовары.НоменклатураПартнера КАК НоменклатураПартнера,
	|	КорректировкаРеализацииТовары.Сумма КАК Сумма,
	|	КорректировкаРеализацииТовары.СтавкаНДС КАК СтавкаНДС,
	|	КорректировкаРеализацииТовары.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	СчетФактураВыданныйТовары КАК СчетФактураВыданныйТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИсходныеДанные КАК КорректировкаРеализацииТовары
	|		ПО СчетФактураВыданныйТовары.Номенклатура = КорректировкаРеализацииТовары.Номенклатура
	|			И СчетФактураВыданныйТовары.Характеристика = КорректировкаРеализацииТовары.Характеристика";  
	
	Запрос.УстановитьПараметр("Реализация", Реализация); 
	Запрос.УстановитьПараметр("Товары", ТаблицаТовары);  
	Возврат Запрос.Выполнить().Выгрузить();  
	
КонецФункции

&ИзменениеИКонтроль("ЗаполнитьТаблицуТоваров")
Процедура Док_ЗаполнитьТаблицуТоваров(РезультатЗаполнения) Экспорт
	
	Если Не (Исправление
		И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПервичныйДокумент")) Тогда
		СчетФактураОснование = РезультатЗаполнения.СчетФактураОснование;
	КонецЕсли;
	Корректировочный = РезультатЗаполнения.Корректировочный;
	Товары.Загрузить(РезультатЗаполнения.Товары);
		
	#Вставка 
	Если ДокументыОснования.Количество() > 0 Тогда
		Если ТипЗнч(ДокументыОснования[0].ДокументОснование)= Тип("ДокументСсылка.КорректировкаРеализации") Тогда 
			КорректировкаРеализации = ДокументыОснования[0].ДокументОснование; 
			Реализация = КорректировкаРеализации.ДокументОснование; 
			Если Реализация.РаспределитьТранспортные Тогда 
				Товары.Загрузить(ПерезаполнитьТаблицуТоваров(Товары, Реализация)); 
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	#КонецВставки
	#Вставка
	Если ДокументыОснования.Количество() > 0 Тогда
		Если ТипЗнч(ДокументыОснования[0].ДокументОснование)= Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда 
			ВозвратТоваровОтКлиента = ДокументыОснования[0].ДокументОснование; 
			Реализация = ВозвратТоваровОтКлиента.ДокументРеализации; 
			Если Реализация.РаспределитьТранспортные Тогда 
				Товары.Загрузить(ПерезаполнитьТаблицуТоваровВозврат(Товары, Реализация)); 
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	#КонецВставки
	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.СчетФактураВыданный);
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ЭтотОбъект, ПараметрыУказанияСерий);
	
КонецПроцедуры

&НаСервере
Функция ПерезаполнитьТаблицуТоваровВозврат(ТаблицаТовары, Реализация)
	
	Запрос = Новый Запрос; 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВозвратТоваровОтКлиента.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДанныеВозвратов
	|ИЗ
	|	Документ.ВозвратТоваровОтКлиента КАК ВозвратТоваровОтКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументовСторноИсправление
	|		ПО ВозвратТоваровОтКлиента.Ссылка = РеестрДокументовСторноИсправление.СторнируемыйДокумент
	|			И (РеестрДокументовСторноИсправление.Проведен)
	|			И (НЕ РеестрДокументовСторноИсправление.ДополнительнаяЗапись)
	|ГДЕ
	|	ВозвратТоваровОтКлиента.Проведен
	|	И ВозвратТоваровОтКлиента.ДокументРеализации = &Реализация
	|	И РеестрДокументовСторноИсправление.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВозвратТоваровОтКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ВозвратТоваровОтКлиентаТовары.Характеристика КАК Характеристика,
	|	СУММА(ВозвратТоваровОтКлиентаТовары.Сумма) КАК Сумма,
	|	ВозвратТоваровОтКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВозвратТоваровОтКлиентаТовары.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ ТоварыВозврата
	|ИЗ
	|	ДанныеВозвратов КАК ДанныеВозвратов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтКлиента.Товары КАК ВозвратТоваровОтКлиентаТовары
	|		ПО ДанныеВозвратов.Ссылка = ВозвратТоваровОтКлиентаТовары.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВозвратТоваровОтКлиентаТовары.Номенклатура,
	|	ВозвратТоваровОтКлиентаТовары.Характеристика,
	|	ВозвратТоваровОтКлиентаТовары.СтавкаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Сумма + ТаблицаТовары.СуммаРТ КАК Сумма,
	|	ТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаТовары.СуммаНДС + ТаблицаТовары.СуммаНДСРТ КАК СуммаНДС
	|ПОМЕСТИТЬ ДанныеРеализацииТранспортные
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Реализация
	|	И ВЫБОР
	|			КОГДА ТаблицаТовары.Ссылка.РаспределитьТранспортные
	|				ТОГДА ТаблицаТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеРеализацииТранспортные.Номенклатура КАК Номенклатура,
	|	ДанныеРеализацииТранспортные.Характеристика КАК Характеристика,
	|	ДанныеРеализацииТранспортные.Сумма - ЕСТЬNULL(ТоварыВозврата.Сумма, 0) КАК Сумма,
	|	ДанныеРеализацииТранспортные.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеРеализацииТранспортные.СуммаНДС - ЕСТЬNULL(ТоварыВозврата.СуммаНДС, 0) КАК СуммаНДС
	|ПОМЕСТИТЬ ДанныеКорректировки
	|ИЗ
	|	ДанныеРеализацииТранспортные КАК ДанныеРеализацииТранспортные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыВозврата КАК ТоварыВозврата
	|		ПО ДанныеРеализацииТранспортные.Номенклатура = ТоварыВозврата.Номенклатура
	|			И ДанныеРеализацииТранспортные.Характеристика = ТоварыВозврата.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураВыданныйТовары.НомерСтроки КАК НомерСтроки,
	|	СчетФактураВыданныйТовары.ПредыдущийСчетФактура КАК ПредыдущийСчетФактура,
	|	СчетФактураВыданныйТовары.ИсходныйСчетФактура КАК ИсходныйСчетФактура,
	|	СчетФактураВыданныйТовары.Номенклатура КАК Номенклатура,
	|	СчетФактураВыданныйТовары.Характеристика КАК Характеристика,
	|	СчетФактураВыданныйТовары.НоменклатураНабора КАК НоменклатураНабора,
	|	СчетФактураВыданныйТовары.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	СчетФактураВыданныйТовары.Содержание КАК Содержание,
	|	СчетФактураВыданныйТовары.ТипЗапасов КАК ТипЗапасов,
	|	СчетФактураВыданныйТовары.КодТНВЭД КАК КодТНВЭД,
	|	СчетФактураВыданныйТовары.НомерГТД КАК НомерГТД,
	|	СчетФактураВыданныйТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СчетФактураВыданныйТовары.Количество КАК Количество,
	|	СчетФактураВыданныйТовары.КоличествоУвеличение КАК КоличествоУвеличение,
	|	СчетФактураВыданныйТовары.КоличествоУменьшение КАК КоличествоУменьшение,
	|	СчетФактураВыданныйТовары.СуммаУвеличение КАК СуммаУвеличение,
	|	СчетФактураВыданныйТовары.СуммаУменьшение КАК СуммаУменьшение,
	|	СчетФактураВыданныйТовары.СуммаНДСУвеличение КАК СуммаНДСУвеличение,
	|	СчетФактураВыданныйТовары.СуммаНДСУменьшение КАК СуммаНДСУменьшение,
	|	СчетФактураВыданныйТовары.СчетФактураПолученныйОтПродавца КАК СчетФактураПолученныйОтПродавца,
	|	СчетФактураВыданныйТовары.НомерСтрокиПриПечати КАК НомерСтрокиПриПечати,
	|	СчетФактураВыданныйТовары.НомерСтрокиИсходногоСФ КАК НомерСтрокиИсходногоСФ,
	|	СчетФактураВыданныйТовары.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
	|	СчетФактураВыданныйТовары.КоличествоПоРНПТУвеличение КАК КоличествоПоРНПТУвеличение,
	|	СчетФактураВыданныйТовары.КоличествоПоРНПТУменьшение КАК КоличествоПоРНПТУменьшение,
	|	СчетФактураВыданныйТовары.Серия КАК Серия,
	|	СчетФактураВыданныйТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	СчетФактураВыданныйТовары.НоменклатураПартнера КАК НоменклатураПартнера
	|ПОМЕСТИТЬ СчетФактураВыданныйТовары
	|ИЗ
	|	&Товары КАК СчетФактураВыданныйТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураВыданныйТовары.НомерСтроки КАК НомерСтроки,
	|	СчетФактураВыданныйТовары.ПредыдущийСчетФактура КАК ПредыдущийСчетФактура,
	|	СчетФактураВыданныйТовары.ИсходныйСчетФактура КАК ИсходныйСчетФактура,
	|	СчетФактураВыданныйТовары.Номенклатура КАК Номенклатура,
	|	СчетФактураВыданныйТовары.Характеристика КАК Характеристика,
	|	СчетФактураВыданныйТовары.НоменклатураНабора КАК НоменклатураНабора,
	|	СчетФактураВыданныйТовары.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	СчетФактураВыданныйТовары.Содержание КАК Содержание,
	|	СчетФактураВыданныйТовары.ТипЗапасов КАК ТипЗапасов,
	|	СчетФактураВыданныйТовары.КодТНВЭД КАК КодТНВЭД,
	|	СчетФактураВыданныйТовары.НомерГТД КАК НомерГТД,
	|	СчетФактураВыданныйТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СчетФактураВыданныйТовары.Количество КАК Количество,
	|	СчетФактураВыданныйТовары.КоличествоУвеличение КАК КоличествоУвеличение,
	|	СчетФактураВыданныйТовары.КоличествоУменьшение КАК КоличествоУменьшение,
	|	СчетФактураВыданныйТовары.СуммаУвеличение КАК СуммаУвеличение,
	|	СчетФактураВыданныйТовары.СуммаУменьшение КАК СуммаУменьшение,
	|	СчетФактураВыданныйТовары.СуммаНДСУвеличение КАК СуммаНДСУвеличение,
	|	СчетФактураВыданныйТовары.СуммаНДСУменьшение КАК СуммаНДСУменьшение,
	|	СчетФактураВыданныйТовары.СчетФактураПолученныйОтПродавца КАК СчетФактураПолученныйОтПродавца,
	|	СчетФактураВыданныйТовары.НомерСтрокиПриПечати КАК НомерСтрокиПриПечати,
	|	СчетФактураВыданныйТовары.НомерСтрокиИсходногоСФ КАК НомерСтрокиИсходногоСФ,
	|	СчетФактураВыданныйТовары.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
	|	СчетФактураВыданныйТовары.КоличествоПоРНПТУвеличение КАК КоличествоПоРНПТУвеличение,
	|	СчетФактураВыданныйТовары.КоличествоПоРНПТУменьшение КАК КоличествоПоРНПТУменьшение,
	|	СчетФактураВыданныйТовары.Серия КАК Серия,
	|	СчетФактураВыданныйТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	СчетФактураВыданныйТовары.НоменклатураПартнера КАК НоменклатураПартнера,
	|	ДанныеКорректировки.Сумма КАК Сумма,
	|	ДанныеКорректировки.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеКорректировки.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	СчетФактураВыданныйТовары КАК СчетФактураВыданныйТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеКорректировки КАК ДанныеКорректировки
	|		ПО СчетФактураВыданныйТовары.Номенклатура = ДанныеКорректировки.Номенклатура
	|			И СчетФактураВыданныйТовары.Характеристика = ДанныеКорректировки.Характеристика
	|";


	Запрос.УстановитьПараметр("Реализация", Реализация); 
	Запрос.УстановитьПараметр("Товары", ТаблицаТовары);  
    	ЗапросТест = Запрос.Выполнить(); 
	Возврат Запрос.Выполнить().Выгрузить();  
	
КонецФункции

#КонецЕсли
